// 1. Задача:
// a.Написать программу, которая позволяет пользователю ввести в консоль два целых числа.
// b.Написать функцию, которая вычислит сумму двух этих чисел и вернёт результат функцию main.
// c.В функции main вывести результат выполнения функции для расчета на экран.


//

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}

// 2. Какой тип можно было бы использовать для функции, 
// если бы нам не надо было возвращать конечный результат в функцию main ?