// 1.	Написать консольное приложение, 
// которое будет выполнять функцию переводчика с английского языка на код Морзе.
// Программа должна принимать на вход строку.
// 2.	Результат работы программы - вывод на экран переведенного на код Морзе текста.
// Буквы в слове разделены пробелами, слова в строке - символом '' / ''.
// 3.	Программа должна уметь переводить в код морзе строчные и
//  заглавные буквы русского алфавита
// 4.	Реализовать возможность перевести несколько фраз за один раз 
// без необходимости перезапуска программы.
// 5.	Код программы должен состоять из функций, 
// выполняющих единственную и конкретную задачу.

#include <iostream>
#include <string>
#include <map>
#include <Windows.h>
using namespace std;

// Создаем функцию для перевода символа в код Морзе
string letterToMorse(char c) {

// Создаем словарь Морзе
    static const map<char, string> codMorse = {
        {'A', ".-"}, {'B', "-..."}, {'C', "-.-."}, {'D', "-.."}, {'E', "."}, {'F', "..-."},
        {'G', "--."}, {'H', "...."}, {'I', ".."}, {'J', ".---"}, {'K', "-.-"}, {'L', ".-.."},
        {'M', "--"}, {'N', "-."}, {'O', "---"}, {'P', ".--."}, {'Q', "--.-"}, {'R', ".-."},
        {'S', "..."}, {'T', "-"}, {'U', "..-"}, {'V', "...-"}, {'W', ".--"}, {'X', "-..-"},
        {'Y', "-.--"}, {'Z', "--.."},
        {'А', ".-"}, {'Б', "-..."}, {'В', ".--"}, {'Г', "--."}, {'Д', "-.."},
        {'Е', "."}, {'Ж', "...-"}, {'З', "--.."}, {'И', ".."}, {'Й', ".---"},
        {'К', "-.-"}, {'Л', ".-.."}, {'М', "--"}, {'Н', "-."}, {'О', "---"},
        {'П', ".--."}, {'Р', ".-."}, {'С', "..."}, {'Т', "-"}, {'У', "..-"},
        {'Ф', "..-."}, {'Х', "...."}, {'Ц', "-.-."}, {'Ч', "---."}, {'Ш', "----"},
        {'Щ', "--.-"}, {'Ъ', ".--.-."}, {'Ы', "-.--"}, {'Ь', "-..-"}, {'Э', "...-..."},
        {'Ю', "..--"}, {'Я', ".-.-"}, {' ', "/"}
    };
    char  upperC = toupper(c);
    if (codMorse.find(upperC) != codMorse.end()) {
        return codMorse.at(upperC);
    }
    return "";
}
// Создаем функцию для перевода строки в код Морзе
string textToMorse(const string& text) {
    string textMorse = "";
    for (char c : text) {
            string morse = letterToMorse(c);
            if (!morse.empty()) {
                textMorse += ' ';
                textMorse += morse;
            }
 
    }
    return textMorse;
}

int main() {
    setlocale(LC_ALL, "Russian");
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
// Вводим текст и реализуем перевод, или выходим из программы
    string textInput;
    do {
        cout << "Для перевода на код Морзе введите текст и нажмите Enter: " << endl;
        cout << "Для выхода из программы введите '1' и нажмите Enter: " << endl;
        getline(cin, textInput);
        string textMorse = textToMorse(textInput);
        cout << "Код на Морзе: " << textMorse << endl;
        cout << endl;
    } 
    while (textInput != "1");
    if (cout << "Выход из программы" << endl);
    system("PAUSE");
    return 0;
}